using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
using Microsoft.Xna.Framework.Input;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace game1
{
    /// <summary>
    ///Mapa gry
    /// </summary>
    class Mapa
    {
        //opis wielkosci elementów mapy
        //deklaracja mapy
        /// <summary>
        /// wysokość elementu
        /// </summary>
        public static readonly int titleHeight = 64;
        /// <summary>
        /// szerokość elementu
        /// </summary>
        public static readonly int titleWidth = 64;
        /// <summary>
        /// opis mapy
        /// </summary>
        public static readonly int[,] mapa_1 = new int[,]{
                {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
                {1,3,0,1,1,1,0,0,0,0,0,0,0,0,0,1,1,1,0,0,1,1,1,1},
                {1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,1,1,1},
                {1,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1},
                {1,0,0,0,1,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,1},
                {1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,3,1},
                {1,1,0,0,0,0,0,0,1,0,0,0,0,0,1,1,1,0,0,0,1,1,1,1},
                {1,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,1,1,0,0,0,0,0,1},
                {1,1,1,1,4,2,4,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1},
                {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
                {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1},
                {1,0,0,0,0,0,0,0,1,1,0,0,1,2,1,0,2,1,2,0,0,0,0,1},
                {1,1,1,1,1,0,0,1,0,0,0,1,0,0,0,0,1,0,0,0,0,1,0,1},
                {1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
                {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1},
                {1,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
                {1,1,1,1,0,0,0,0,1,1,0,0,1,0,0,0,0,0,0,2,1,1,1,1},
                {1,0,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,1,1,1},
                {1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,1,1,1,1},
                {1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1},
                {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
            };
        /// <summary>
        /// Mapa
        /// </summary>
        public Mapa(GraphicsDevice graphicsDevice)
        {
        }

    }
}


